# Brewfile — snapshot of installed packages.
# Restore on a new machine: brew bundle install
# Update this file: brew bundle dump --force --file ~/dotfiles/Brewfile

tap "antoniorodr/memo"
tap "atlassian/tap"
tap "heroku/brew"
tap "steipete/tap"
brew "python@3.13"
brew "awscli"
brew "caddy"
brew "cmake"
brew "cocoapods"
brew "docker-compose"
brew "doctl"
brew "eza"
brew "gemini-cli"
brew "gh"
brew "git"
brew "glances"
brew "imagemagick"
brew "ios-sim"
brew "jpeg"
brew "libavif"
brew "llm"
brew "mas"
brew "nvm"
brew "ollama", restart_service: :changed
brew "protobuf"
brew "openai-whisper"
brew "openjdk@17"
brew "pipenv"
brew "pstree"
brew "pyenv"
brew "python@3.10"
brew "qpdf"
brew "redis"
brew "rust"
brew "shellcheck"
brew "uv"
brew "wdiff"
brew "wget"
brew "xclip"
brew "yt-dlp"
brew "zsh"
brew "antoniorodr/memo/memo"
brew "atlassian/tap/atlassian-plugin-sdk"
brew "steipete/tap/gifgrep"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/imsg"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"
cask "amazon-photos"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "appcleaner"
cask "beekeeper-studio"
cask "bluestacks"
cask "claude"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "figma"
cask "firefox"
cask "framer"
cask "free-ruler"
cask "gog-galaxy"
cask "google-chrome"
cask "google-drive"
cask "granola"
cask "iina"
cask "iterm2"
cask "jitsi-meet"
cask "messenger"
cask "nordvpn"
cask "notion"
cask "openemu"
cask "pika"
cask "proton-drive"
cask "proton-mail"
cask "proton-mail-bridge"
cask "protonvpn"
cask "rambox"
cask "session-manager-plugin"
cask "signal"
cask "slack"
cask "stremio"
cask "telegram"
cask "visual-studio-code"
cask "wechat"
cask "whatsapp"
cask "whisky"
cask "xcodes-app"
cask "zalo"
vscode "andrepimenta.claude-code-chat"
vscode "anthropic.claude-code"
vscode "ban.spellright"
vscode "biomejs.biome"
vscode "chakrounanas.turbo-console-log"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "humao.rest-client"
vscode "iulian-radu-at.find-unused-exports"
vscode "juanallo.vscode-dependency-cruiser"
vscode "labnol.google-apps-script"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "natqe.reload"
vscode "nhoizey.gremlins"
vscode "oouo-diogo-perdigao.docthis"
vscode "qezhu.gitlink"
vscode "reduckted.vscode-gitweblinks"
vscode "streetsidesoftware.code-spell-checker"
vscode "zencoderai.zencoder"
uv "nano-pdf"
